inventory_service_perf/wrk_report/inventory_python312_mix_1100.txt
next_player_id is achive 100000 and reset to 1
Running 2m test @ http://eniac-bench:8080
  1 threads and 100 connections
  Thread calibration: mean lat.: 5.638ms, rate sampling interval: 23ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.49ms    7.29ms 266.75ms   89.83%
    Req/Sec     1.12k   244.74     1.86k    74.75%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.77ms
 75.000%    7.57ms
 90.000%   13.92ms
 99.000%   33.89ms
 99.900%   72.57ms
 99.990%  176.38ms
 99.999%  264.19ms
100.000%  267.01ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.687     0.000000            2         1.00
       1.612     0.100000        12075         1.11
       2.012     0.200000        24094         1.25
       2.583     0.300000        36136         1.43
       3.895     0.400000        48195         1.67
       4.771     0.500000        60249         2.00
       5.147     0.550000        66259         2.22
       5.535     0.600000        72300         2.50
       6.007     0.650000        78310         2.86
       6.639     0.700000        84324         3.33
       7.567     0.750000        90350         4.00
       8.163     0.775000        93364         4.44
       8.855     0.800000        96366         5.00
       9.647     0.825000        99372         5.71
      10.655     0.850000       102384         6.67
      12.071     0.875000       105391         8.00
      12.951     0.887500       106907         8.89
      13.919     0.900000       108405        10.00
      15.095     0.912500       109912        11.43
      16.263     0.925000       111413        13.33
      17.455     0.937500       112931        16.00
      18.079     0.943750       113687        17.78
      18.655     0.950000       114428        20.00
      19.295     0.956250       115198        22.86
      19.999     0.962500       115940        26.67
      20.911     0.968750       116692        32.00
      21.375     0.971875       117059        35.56
      22.095     0.975000       117433        40.00
      23.119     0.978125       117812        45.71
      24.575     0.981250       118186        53.33
      26.767     0.984375       118568        64.00
      28.079     0.985938       118752        71.11
      30.063     0.987500       118941        80.00
      32.543     0.989062       119127        91.43
      34.719     0.990625       119315       106.67
      37.503     0.992188       119506       128.00
      38.943     0.992969       119598       142.22
      41.055     0.993750       119693       160.00
      42.655     0.994531       119786       182.86
      44.639     0.995313       119881       213.33
      47.391     0.996094       119975       256.00
      48.543     0.996484       120022       284.44
      50.111     0.996875       120068       320.00
      51.743     0.997266       120116       365.71
      54.655     0.997656       120162       426.67
      58.175     0.998047       120209       512.00
      60.415     0.998242       120233       568.89
      63.839     0.998437       120256       640.00
      65.983     0.998633       120280       731.43
      68.863     0.998828       120303       853.33
      73.343     0.999023       120327      1024.00
      75.775     0.999121       120339      1137.78
      78.271     0.999219       120350      1280.00
      82.431     0.999316       120362      1462.86
      84.735     0.999414       120374      1706.67
      90.687     0.999512       120387      2048.00
      92.991     0.999561       120392      2275.56
      96.319     0.999609       120397      2560.00
      97.663     0.999658       120403      2925.71
     106.687     0.999707       120409      3413.33
     112.191     0.999756       120415      4096.00
     113.663     0.999780       120418      4551.11
     126.335     0.999805       120421      5120.00
     145.535     0.999829       120424      5851.43
     154.751     0.999854       120427      6826.67
     172.159     0.999878       120430      8192.00
     175.615     0.999890       120431      9102.22
     178.687     0.999902       120433     10240.00
     181.887     0.999915       120434     11702.86
     201.215     0.999927       120436     13653.33
     233.599     0.999939       120437     16384.00
     247.423     0.999945       120438     18204.44
     253.695     0.999951       120439     20480.00
     253.695     0.999957       120439     23405.71
     256.255     0.999963       120440     27306.67
     259.455     0.999969       120441     32768.00
     259.455     0.999973       120441     36408.89
     262.399     0.999976       120442     40960.00
     262.399     0.999979       120442     46811.43
     262.399     0.999982       120442     54613.33
     264.191     0.999985       120443     65536.00
     264.191     0.999986       120443     72817.78
     264.191     0.999988       120443     81920.00
     264.191     0.999989       120443     93622.86
     264.191     0.999991       120443    109226.67
     267.007     0.999992       120444    131072.00
     267.007     1.000000       120444          inf
#[Mean    =        6.491, StdDeviation   =        7.288]
#[Max     =      266.752, Total count    =       120444]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  131771 requests in 2.00m, 40.54MB read
Requests/sec:   1098.09
Transfer/sec:    345.97KB