inventory_service_perf/wrk_report/inventory_python312_mix_1100_v2.txt
Running 2m test @ http://eniac-bench:8080
  1 threads and 100 connections
  Thread calibration: mean lat.: 6.675ms, rate sampling interval: 29ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.24ms    8.71ms 308.22ms   92.46%
    Req/Sec     1.12k   209.23     1.78k    75.46%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.59ms
 75.000%    6.92ms
 90.000%   12.58ms
 99.000%   33.12ms
 99.900%  123.01ms
 99.990%  244.61ms
 99.999%  286.46ms
100.000%  308.48ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.695     0.000000            1         1.00
       1.566     0.100000        12068         1.11
       1.955     0.200000        24112         1.25
       2.453     0.300000        36173         1.43
       3.655     0.400000        48180         1.67
       4.587     0.500000        60294         2.00
       4.939     0.550000        66247         2.22
       5.299     0.600000        72334         2.50
       5.691     0.650000        78335         2.86
       6.183     0.700000        84324         3.33
       6.919     0.750000        90343         4.00
       7.423     0.775000        93360         4.44
       8.039     0.800000        96369         5.00
       8.791     0.825000        99373         5.71
       9.631     0.850000       102395         6.67
      10.823     0.875000       105393         8.00
      11.647     0.887500       106905         8.89
      12.583     0.900000       108408        10.00
      13.687     0.912500       109916        11.43
      14.999     0.925000       111414        13.33
      16.399     0.937500       112936        16.00
      17.103     0.943750       113685        17.78
      17.759     0.950000       114439        20.00
      18.431     0.956250       115185        22.86
      19.167     0.962500       115934        26.67
      20.047     0.968750       116695        32.00
      20.527     0.971875       117058        35.56
      21.119     0.975000       117435        40.00
      21.935     0.978125       117817        45.71
      23.071     0.981250       118188        53.33
      25.087     0.984375       118566        64.00
      26.783     0.985938       118754        71.11
      28.719     0.987500       118940        80.00
      31.391     0.989062       119129        91.43
      34.111     0.990625       119319       106.67
      37.279     0.992188       119506       128.00
      39.679     0.992969       119599       142.22
      41.471     0.993750       119693       160.00
      43.871     0.994531       119789       182.86
      49.119     0.995313       119881       213.33
      59.007     0.996094       119975       256.00
      63.359     0.996484       120022       284.44
      66.623     0.996875       120069       320.00
      71.487     0.997266       120116       365.71
      76.799     0.997656       120163       426.67
      82.047     0.998047       120210       512.00
      86.335     0.998242       120234       568.89
      90.495     0.998437       120257       640.00
      95.167     0.998633       120281       731.43
     108.863     0.998828       120304       853.33
     124.543     0.999023       120328      1024.00
     130.687     0.999121       120340      1137.78
     135.295     0.999219       120351      1280.00
     144.383     0.999316       120363      1462.86
     153.727     0.999414       120375      1706.67
     161.279     0.999512       120387      2048.00
     165.247     0.999561       120393      2275.56
     169.215     0.999609       120398      2560.00
     178.047     0.999658       120404      2925.71
     185.343     0.999707       120410      3413.33
     191.231     0.999756       120416      4096.00
     194.303     0.999780       120419      4551.11
     201.983     0.999805       120422      5120.00
     213.503     0.999829       120425      5851.43
     220.287     0.999854       120428      6826.67
     232.447     0.999878       120431      8192.00
     242.687     0.999890       120432      9102.22
     246.527     0.999902       120434     10240.00
     247.935     0.999915       120435     11702.86
     265.215     0.999927       120437     13653.33
     266.751     0.999939       120438     16384.00
     267.007     0.999945       120439     18204.44
     267.519     0.999951       120440     20480.00
     267.519     0.999957       120440     23405.71
     268.287     0.999963       120441     27306.67
     272.383     0.999969       120442     32768.00
     272.383     0.999973       120442     36408.89
     281.343     0.999976       120443     40960.00
     281.343     0.999979       120443     46811.43
     281.343     0.999982       120443     54613.33
     286.463     0.999985       120444     65536.00
     286.463     0.999986       120444     72817.78
     286.463     0.999988       120444     81920.00
     286.463     0.999989       120444     93622.86
     286.463     0.999991       120444    109226.67
     308.479     0.999992       120445    131072.00
     308.479     1.000000       120445          inf
#[Mean    =        6.243, StdDeviation   =        8.706]
#[Max     =      308.224, Total count    =       120445]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  131770 requests in 2.00m, 40.42MB read
Requests/sec:   1098.08
Transfer/sec:    344.89KB